app/Controllers/Blog.php

    public function index(): string // Funcion index, retorna la vista del blog.
    {
        if (!session()->get('email')) { // En caso de cerrar sesion e intentar volver a la vista, pide volver a iniciar sesion.
            return redirect()->to(base_url('/'))
            ->with('message','La sesion ha concluido. Por favor vuelve a iniciar sesion.')
            ->with('type','warning');
        }

        helper('post-time'); // Incluye el "Helper" para saber hace cuanto tiempo se hizo "x" publicacion.

        $postModel = new Posts(); // Instancia con el modelo "Posts".

        $posts = $postModel
            ->select('posts.*,users.user')
            ->join('users','users.id_user = posts.id_user')
            ->orderBy('posts.created_at','DESC')
            ->findAll();
---
SELECT `posts`.*, `users`.`user`
FROM `posts`
JOIN `users` ON `users`.`id_user` = `posts`.`id_user`
ORDER BY `posts`.`created_at` DESC