app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1
---
    public function login() // Funcion para iniciar sesion.
    {
        if (!$this->validate([ // Validacion de los datos del registro para que cumplan las condiciones.
            'email' => [
                'label' => 'correo electrónico', // Campos label para que los mensajes de error digan "correo electronico" y no "email".
                'rules' => 'required|valid_email',
            ],
            'password' => [
                'label' => 'contraseña',
                'rules' => 'required',
            ],
        ])) {
            return redirect()->back()->withInput() // Nos redirige al formulario de login y muestra los mensajes de error.
                ->with('validation', $this->validator)
                ->with('message', $this->validator->getErrors()) // Obtenemos los errores.
                ->with('type', 'danger');
        }

        $email = $this->request->getPost('email'); // Guarda el email en una variable.
        $password = $this->request->getPost('password'); // Guarda la contraseña en una variable.

        $userModel = new Users(); // Instancia con el modelo "Users".
        $user = $userModel->where('email', $email)->first(); // Almacena al primer usuario que coincida con el email (que es unico).