app/Models/Users.php

SELECT *
FROM `users`
WHERE `user` = 'a'
---
    public function getUser($data){
        $user = $this->db->table('users');
        $user->where($data);
        return $user->get()->getResultArray();